---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReininforcementWarn
source: html/8fbc14fa-0298-7d78-e685-99b8ed31f552.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReininforcementWarn Property

Can't find a host for Path Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlacePathReininforcementWarn { get; }
```